<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of Nudge and builds a package.</string>
	<key>Identifier</key>
	<string>com.github.jordanjeffries-recipes.pkg.Nudge</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Nudge</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.erikng.download.Nudge</string>
	<key>Process</key>
	<array>
			<dict>
					<key>Arguments</key>
					<dict>
							<key>destination_path</key>
							<string>%RECIPE_CACHE_DIR%/unpack</string>
							<key>flat_pkg_path</key>
							<string>%pathname%/Nudge.pkg</string>
					</dict>
					<key>Processor</key>
					<string>FlatPkgUnpacker</string>
			</dict>
			<dict>
					<key>Arguments</key>
					<dict>
							<key>destination_path</key>
							<string>%RECIPE_CACHE_DIR%/payload</string>
							<key>pkg_payload_path</key>
							<string>%RECIPE_CACHE_DIR%/unpack/Nudge.pkg/Payload</string>
					</dict>
					<key>Processor</key>
					<string>PkgPayloadUnpacker</string>
			</dict>
			<dict>
					<key>Arguments</key>
					<dict>
							<key>info_path</key>
							<string>%RECIPE_CACHE_DIR%/payload/Nudge.app/Contents/Info.plist</string>
							<key>plist_keys</key>
							<dict>
									<key>CFBundleVersion</key>
									<string>version</string>
									<key>LSMinimumSystemVersion</key>
									<string>min_os_version</string>
							</dict>
					</dict>
					<key>Processor</key>
					<string>PlistReader</string>
			</dict>
			<dict>
					<key>Arguments</key>
					<dict>
							<key>source_pkg</key>
							<string>%pathname%/Nudge.pkg</string>
							<key>pkg_path</key>
							<string>%RECIPE_CACHE_DIR%/Nudge-%version%.pkg</string>
					</dict>
					<key>Processor</key>
					<string>PkgCopier</string>
			</dict>
	</array>
</dict>
</plist>
