<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of Nudge and builds a package.</string>
	<key>Identifier</key>
	<string>com.github.jordanjeffries.pkg.Nudge</string>
	<key>Input</key>
<dict>
	<key>NAME</key>
	<string>Nudge</string>
</dict>
<key>ParentRecipe</key>
<string>com.github.erikng.download.Nudge</string>
<key>MinimumVersion</key>
<string>1.0.4</string>
<array>
	<dict>
		<key>Processor</key>
		<string>PkgCopier</string>
		</dict>
			</array>
		</dict>
</plist>
